from typing import Literal, List, Dict, Any

class MMPIEngine:
    def __init__(self, age: int, gender: str, answers: List[int]):
        """
        age: سن کاربر (عدد)
        gender: جنسیت ('مرد' یا 'زن')
        answers: لیست پاسخ‌ها (0 برای بله، 1 برای خیر)
        """
        self.age = age
        self.gender = gender
        self.answers = answers

    def process(self) -> Dict[str, Any]:
        if not (16 <= self.age):
            return {"error": "این تست برای افراد بالای 16 سال مناسب می باشد. لطفا از تست های مربوطه دیگر استفاده فرمایید.", "is_valid": False}

        profile = {}
        if self.gender == "مرد":
            if self.age < 18:
                profile = {
                    "L":{0:40,1:50,2:55,3:60,5:77},
                    "F":{0:30,5:50,10:65,15:90},
                    "K":{0:28,5:47,10:65,15:85,16:88},
                    "Hs":{0:27,5:50,10:80,14:100},
                    "D":{0:30,5:50,10:65,15:83,20:95},
                    "Hy":{0:13,5:35,10:50,15:70,20:90,25:105},
                    "Pd":{0:25,5:47,10:65,15:85},
                    "Pa":{0:27,5:47,10:65,14:85,19:97},
                    "Pt":{0:27,5:47,10:60,15:75,16:80},
                    "Sc":{0:0,5:35,10:55,15:73,95:20},
                    "Ma":{0:25,5:50,10:70,11:75}
                }
            else:
                profile = {
                    "L":{0:40,1:50,2:55,3:60,5:83,},
                    "F":{0:37,5:60,10:85,15:105},
                    "K":{5:45,10:60,15:77,16:85},
                    "Hs":{0:37,5:53,10:75,14:87},
                    "D":{0:30,5:50,10:65,15:83,20:95,},
                    "Hy":{0:10,5:35,10:50,15:70,20:90,25:105},
                    "Pd":{0:25,5:43,10:65,15:85,19:97},
                    "Pa":{0:30,5:53,10:80,14:95},
                    "Pt":{0:32,5:50,10:63,15:80,16:85},
                    "Sc":{0:33,5:45,10:60,15:75,20:87},
                    "Ma":{0:25,5:50,10:73,11:77}                        
                } 
        else:
            if self.age < 18:
                profile = {
                    "L":{0:35,1:45,2:53,3:60,4:67,5:73},
                    "F":{0:35,5:55,10:75,15:97},
                    "K":{0:25,5:50,10:70,15:95,16:98},
                    "Hs":{0:30,5:53,10:75,14:95},
                    "D":{0:27,5:45,10:57,15:70,20:90},
                    "Hy":{0:13,5:35,10:50,15:70,20:90,25:105},
                    "Pd":{0:25,5:47,10:65,15:85,19:97,},
                    "Pa":{0:27,5:53,10:80,14:95},
                    "Pt":{0:32,5:50,10:62,15:80,16:85},
                    "Sc":{0:17,5:37,10:55,15:70,20:87},
                    "Ma":{0:17,5:45,10:67,11:73}
                }
            else:
                profile = {
                    "L":{0:35,2:55,3:60,4:65,},
                    "F":{0:37,5:60,10:85,15:110},
                    "K":{0:20,5:45,10:60,15:85,16:90},
                    "Hs":{0:37,5:55,10:80,14:97},
                    "D":{0:25,5:43,10:55,15:75,20:90},
                    "Hy":{0:7,10:50,15:70,20:90,25:105},
                    "Pd":{0:25,5:45,10:65,15:85,19:100},
                    "Pa":{0:30,5:53,10:75,14:95},
                    "Pt":{0:30,5:50,15:75,16:77,},
                    "Sc":{0:30,5:45,15:75,20:90},
                    "Ma":{0:30,5:50,10:75}   
                }

        converted_answers = ['بله' if score == 0 else 'خیر' for score in self.answers]

        scoring_key = {
            1: {'Hs': 'خیر', 'D': 'خیر', 'Hy': 'خیر'},
            2: {'Hs': 'خیر', 'Hy': 'خیر', 'Pt': 'خیر'},
            3: {'D': 'خیر', 'Hy': 'خیر', 'Pd': 'خیر', 'Sc': 'خیر', 'Pt': 'خیر'},
            4: {'D': 'بله', 'Ma': 'بله'},
            5: {'L': 'خیر', 'Pa': 'بله', 'Pt': 'بله', 'Sc': 'بله'},
            6: {'Hs': 'خیر', 'D': 'خیر'},
            7: {'Pd': 'بله', 'Sc': 'بله', 'Ma': 'بله'},
            8: {'Pa': 'بله', 'Pt': 'بله', 'Sc': 'بله', 'Ma': 'بله'},
            9: {'F': 'بله', 'Hs': 'بله', 'D': 'بله', 'Hy': 'بله'},
            10: {'Pd': 'بله', 'Pa': 'بله', 'Sc': 'بله'},
            11: {'L': 'خیر', 'K': 'خیر', 'D': 'خیر', 'Hy': 'خیر'},
            12: {'F': 'بله'},
            13: {'D': 'بله', 'Pd': 'بله', 'Pt': 'بله', 'Sc': 'بله'},
            14: {'Pd': 'بله', 'Sc': 'بله'},
            15: {'F': 'بله', 'Pd': 'بله', 'Pa': 'بله', 'Sc': 'بله'},
            16: {'Pd': 'بله', 'Sc': 'بله'},
            17: {'D': 'بله', 'Pt': 'بله', 'Sc': 'بله'},
            18: {'Hs': 'بله', 'D': 'بله', 'Hy': 'بله'},
            19: {'F': 'بله'},
            20: {'F': 'خیر'},
            21: {'Hy': 'خیر', 'Sc': 'بله'},
            22: {'D': 'بله', 'Pd': 'بله', 'Pt': 'بله'},
            23: {'K': 'خیر', 'Hy': 'خیر'},
            24: {'L': 'خیر', 'F': 'خیر'},
            25: {'D': 'بله', 'Pt': 'بله'},
            26: {'Hs': 'خیر', 'Hy': 'خیر', 'Sc': 'خیر'},
            27: {'Pd': 'بله', 'Pt': 'بله'},
            28: {'D': 'خیر', 'Hy': 'خیر', 'Pd': 'خیر', 'Pa': 'خیر'},
            29: {'Hy': 'خیر', 'Pa': 'خیر', 'Ma': 'بله'},
            30: {'F': 'بله', 'Pa': 'بله', 'Sc': 'بله'},
            31: {'K': 'خیر', 'Pa': 'خیر', 'Pt': 'بله'},
            32: {'Hs': 'بله'},
            33: {'K': 'خیر'},
            34: {'K': 'خیر', 'Pd': 'بله', 'Ma': 'بله'},
            35: {'Hy': 'خیر', 'Pd': 'بله'},
            36: {'K': 'خیر', 'Hs': 'بله'},
            37: {'D': 'خیر', 'Hy': 'خیر'},
            38: {'F': 'بله', 'Sc': 'بله', 'Ma': 'بله'},
            39: {'Pa': 'بله', 'Sc': 'بله', 'Ma': 'بله'},
            40: {'K': 'خیر', 'D': 'خیر', 'Hy': 'خیر'},
            41: {'K': 'خیر', 'Hy': 'خیر', 'Pd': 'خیر'},
            42: {'D': 'خیر', 'Pt': 'خیر'},
            43: {'K': 'خیر', 'Hy': 'خیر', 'Pd': 'خیر', 'Ma': 'خیر'},
            44: {'Hs': 'بله', 'D': 'بله', 'Hy': 'بله', 'Pt': 'بله'},
            45: {'Hs': 'خیر', 'Hy': 'خیر'},
            46: {'Hs': 'خیر', 'Hy': 'خیر', 'Sc': 'خیر'},
            47: {'L': 'خیر'},
            48: {'F': 'بله'},
            49: {'Hy': 'خیر', 'Pd': 'خیر'},
            50: {'F': 'بله'},
            51: {'K': 'خیر', 'Pt': 'بله'},
            52: {'Pd': 'بله'},
            53: {'L': 'خیر'},
            54: {'Ma': 'بله'},
            55: {'K': 'خیر', 'Hs': 'خیر', 'Hy': 'خیر'},
            56: {'Hy': 'خیر'},
            57: {'Hy': 'بله','Pa':'بله', 'Pt': 'بله', 'Sc': 'بله', 'Ma': 'بله'},
            58: {'F': 'بله', 'Pd': 'بله'},
            59: {'F': 'بله'},
            60: {'D': 'خیر', 'Ma': 'بله'},
            61: {'F': 'خیر', 'K': 'خیر', 'D': 'خیر'},
            62: {'Hs': 'خیر', 'Hy': 'خیر'},
            63: {'Hs': 'خیر', 'Pa': 'خیر', 'Sc': 'خیر'},
            64: {'F': 'بله', 'Pa': 'بله'},
            65: {'D': 'خیر', 'Pd': 'خیر', 'Ma': 'بله'},
            66: {'K': 'خیر', 'Pa': 'بله', 'Pt': 'بله', 'Sc': 'بله'},
            67: {'Pa': 'خیر'},
            68: {'Pa': 'بله', 'Pt': 'بله'},
            69: {'K': 'خیر'},
            70: {'K': 'خیر'},
            71: {'F': 'بله', 'Pd': 'بله'}
        }

        validity_scores = {'L': 0, 'F': 0, 'K': 0}
        clinical_scores = {'Hs': 0, 'D': 0, 'Hy': 0, 'Pd': 0, 'Pa': 0, 'Pt': 0, 'Sc': 0, 'Ma': 0}

        for q_num, answer in enumerate(converted_answers, start=1):
            if q_num in scoring_key:
                scale_answers = scoring_key[q_num]
                for scale, expected_answer in scale_answers.items():
                    if answer == expected_answer:
                        if scale in validity_scores:
                            validity_scores[scale] += 1
                        elif scale in clinical_scores:
                            clinical_scores[scale] += 1

        t_scores = {}
        for scale, raw_score in {**validity_scores, **clinical_scores}.items():
            scale_dict = profile.get(scale, {})
            sorted_keys = sorted(scale_dict.keys())
            
            if not sorted_keys:
                continue 

            if raw_score in scale_dict:
                t_scores[scale] = scale_dict[raw_score]
            else:
                if raw_score < sorted_keys[0]:
                    t_scores[scale] = scale_dict[sorted_keys[0]]
                elif raw_score > sorted_keys[-1]:
                    t_scores[scale] = scale_dict[sorted_keys[-1]]
                else:
                    for i in range(len(sorted_keys) - 1):
                        low = sorted_keys[i]
                        high = sorted_keys[i + 1]
                        
                        if low <= raw_score <= high:
                            low_t = scale_dict[low]
                            high_t = scale_dict[high]
                            t_scores[scale] = low_t + (raw_score - low) / (high - low) * (high_t - low_t)
                            break

        interpretations = {}

        hs_score = t_scores.get('Hs', 0)
        d_score = t_scores.get('D', 0)
        sc_score = t_scores.get('Sc', 0)
        pt_score = t_scores.get('Pt', 0)
        hy_score = t_scores.get('Hy', 0)
        f_score = t_scores.get('F', 0)
        l_score = t_scores.get('L', 0)
        k_score = t_scores.get('K', 0)
        pd_score = t_scores.get('Pd', 0)
        ma_score = t_scores.get('Ma', 0)
        pa_score = t_scores.get('Pa', 0)

        d_text = """این مقیاس عمق حالت بالینی افسردگی را می‌سنجد. افسردگی ممکن است نموداری از اختلال اساسی وضع بیمار باشد و به عنوان نتیجه مشکلات تشخیصی تظاهر کند."""
        d_interpretation = ""
        d_nomre = ""

        if d_score >= 70:
            d_nomre = "وجود اختلال"
            d_interpretation = (
                """نمره زیاد در ۲۰ سؤال این مقیاس، میزان وخامت وضع آزمودنی را می‌رساند و نشان‌دهنده این است که آزمودنی فردی هیجانی و نسبت به آینده ناامید است و خود را بی‌فایده و بی‌لیاقت می‌پندارد. بیماران افسرده، ساکت و گوشه‌گیر هستند، در بحث و گفت‌وگو به گفته‌های دیگران توجهی ندارند و همیشه از بحث اصلی دور می‌شوند. دارای بازداری‌های فراوانی هستند و در بیان تمایلات خویش مشکلات فراوانی دارند. نمره زیاد در این مقیاس با اینکه معرف افسردگی است، تقریباً در افراد سایکوتیک دیده می‌شود و همچنین گاه نمره بالا در این مقیاس نشانه زمینه‌های شخصیتی خاصی است که از بی‌اعتمادی به خود، اضطراب، محدود بودن رغبت‌ها و درون‌گرایی فرد حکایت می‌کند. آن‌ها احتمالاً افرادی تحت کنترل، کنجکاو در مورد خود و حتی شاید مستعد خودنمایی نیز هستند."""
                """نمره بالا در مقیاس D نشانگر افسردگی واکنشی است، به خصوص اگر تنها مقیاس بالا بر روی پروفایل باشد. احتمالاً برخورد فرد با مشکلاتش همراه با بدبینی، درماندگی و ناامیدی است و چنین افرادی ممکن است دارای احساس بی‌کفایتی، ضعف اخلاقی و مشکل در تمرکز حواس بوده و این حالت‌ها ممکن است به قدری شدید باشند که در کارایی شغلی فرد ایجاد مشکل کند. چنین افرادی ممکن است با صفاتی چون غیرمعاشرتی، خجالتی، کناره‌گیر، ترسو، بازداری‌شده و در عین حال تحریک‌پذیر و کم‌طاقت توصیف شوند."""
                """برخلاف مقیاس هیپوکندری، این مقیاس نسبت به درمان بسیار حساس است و به مجرد اینکه در علائم بالینی بهبودی حاصل شود، نتایج این مقیاس نیز پایین می‌آید."""
            )
        elif 60 <= d_score < 70:
            d_nomre = "آمادگی یا گرایش ابتلا به اختلال"
            d_interpretation = (
                """نمره زیاد در ۲۰ سؤال این مقیاس، میزان وخامت وضع آزمودنی را می‌رساند و نشان‌دهنده این است که آزمودنی فردی هیجانی و نسبت به آینده ناامید است و خود را بی‌فایده و بی‌لیاقت می‌پندارد. بیماران افسرده، ساکت و گوشه‌گیر هستند، در بحث و گفت‌وگو به گفته‌های دیگران توجهی ندارند و همیشه از بحث اصلی دور می‌شوند. دارای بازداری‌های فراوانی هستند و در بیان تمایلات خویش مشکلات فراوانی دارند. نمره زیاد در این مقیاس با اینکه معرف افسردگی است، تقریباً در افراد سایکوتیک دیده می‌شود و همچنین گاه نمره بالا در این مقیاس نشانه زمینه‌های شخصیتی خاصی است که از بی‌اعتمادی به خود، اضطراب، محدود بودن رغبت‌ها و درون‌گرایی فرد حکایت می‌کند. آن‌ها احتمالاً افرادی تحت کنترل، کنجکاو در مورد خود و حتی شاید مستعد خودنمایی نیز هستند."""
                """نمره بالا در مقیاس D نشانگر افسردگی واکنشی است، به خصوص اگر تنها مقیاس بالا بر روی پروفایل باشد. احتمالاً برخورد فرد با مشکلاتش همراه با بدبینی، درماندگی و ناامیدی است و چنین افرادی ممکن است دارای احساس بی‌کفایتی، ضعف اخلاقی و مشکل در تمرکز حواس بوده و این حالت‌ها ممکن است به قدری شدید باشند که در کارایی شغلی فرد ایجاد مشکل کند. چنین افرادی ممکن است با صفاتی چون غیرمعاشرتی، خجالتی، کناره‌گیر، ترسو، بازداری‌شده و در عین حال تحریک‌پذیر و کم‌طاقت توصیف شوند."""
                """برخلاف مقیاس هیپوکندری، این مقیاس نسبت به درمان بسیار حساس است و به مجرد اینکه در علائم بالینی بهبودی حاصل شود، نتایج این مقیاس نیز پایین می‌آید."""
            )
        elif 40 <= d_score < 60:
            d_nomre = "به‌هنجار"
            d_interpretation = (
                """نمره بین ۴۰ تا ۶۰ نشان‌دهنده سطح عادی از سازگاری با محیط و حالت شادابی است."""
            )
        else:
            d_nomre = "کم"
            d_interpretation = (
                """گاهی پایین بودن این مقیاس بر روی پروفایل ممکن است بیانگر این باشد که شخص سطوح مهم افسردگی پنهان خود را انکار کند."""
                """نمره کم در این مقیاس نشانه شادابی و فعال بودن و تطابق با محیط را نشان می‌دهد."""
            )
        interpretations['D'] = {'text': d_text, 'interpretation': d_interpretation, 't_score': d_score, 'nomre': d_nomre}


        hs_text = """تعداد سؤال‌ها در این مقیاس ۱۴ است. این مقیاس توجه طبیعی فرد را نسبت به اعمال بدنی (وضع جسمانی و سلامتی خویش) ارزیابی می‌کند."""
        hs_interpretation = ""
        hs_nomre = ""

        if hs_score >= 70:
            hs_nomre = "وجود اختلال"
            hs_interpretation = (
                """نمره زیاد در این مقیاس نشان‌دهنده این است که افراد مبتلا نسبت به حالت سلامتی خود به طور مبالغه‌آمیزی اضطراب و نگرانی دارند و از وضع جسمانی خود ناراضی هستند و نسبت به پدیده‌های طبیعی خصومت می‌ورزند و سعی دارند که از طریق دردهای جسمانی توجه دیگران را به خود جلب کنند و نیز افرادی هستند لجباز، بدبین، خودشیفته و خودمحور که جز منافع و ارضای نیازهای خویش به چیز دیگری توجه ندارند و در روان‌درمانی نمی‌توان همکاری‌های لازم را از آن‌ها توقع داشت."""
                """نمره بسیار بالا ممکن است بیانگر این مطلب باشد که شخص دارای انواع گسترده‌ای از شکوه‌های مربوط به علائم بیماری است و شاید فرد به شدت تحت فشار باشد."""
                """باید یادآور شد که بیماری‌های عضوی معمولاً نمره و نتیجه آزمودنی را در این مقیاس بالا نمی‌برند و مقیاس Hs بیماری عضوی و بیماری هیپوکندری را به خوبی از یکدیگر تفکیک می‌نماید."""
            )
        elif 60 <= hs_score < 70:
            hs_nomre = "آمادگی یا گرایش ابتلا به اختلال"
            hs_interpretation = (
                """نمره زیاد در این مقیاس نشان‌دهنده این است که افراد مبتلا نسبت به حالت سلامتی خود به طور مبالغه‌آمیزی اضطراب و نگرانی دارند و از وضع جسمانی خود ناراضی هستند و نسبت به پدیده‌های طبیعی خصومت می‌ورزند و سعی دارند که از طریق دردهای جسمانی توجه دیگران را به خود جلب کنند و نیز افرادی هستند لجباز، بدبین، خودشیفته و خودمحور که جز منافع و ارضای نیازهای خویش به چیز دیگری توجه ندارند و در روان‌درمانی نمی‌توان همکاری‌های لازم را از آن‌ها توقع داشت."""
                """در ضمن نمره‌های متوسط بالا احتمالاً نشان‌دهنده این مطلب است که فرد در خصوص ناراحتی‌های جسمی واقعی خود مبالغه می‌کند."""
                """باید یادآور شد که بیماری‌های عضوی معمولاً نمره و نتیجه آزمودنی را در این مقیاس بالا نمی‌برند و مقیاس Hs بیماری عضوی و بیماری هیپوکندری را به خوبی از یکدیگر تفکیک می‌نماید."""
            )
        elif 40 <= hs_score < 60:
            hs_nomre = "به‌هنجار"
            hs_interpretation = (
                """نمره بین ۴۰ تا ۶۰ نشان‌دهنده سطح عادی از توجه به وضعیت جسمانی است. این سطح نمره معمولاً در افرادی مشاهده می‌شود که توجه طبیعی به سلامتی خویش دارند و سازگاری نسبی با محیط دارند."""
                """افرادی که نمره‌های متوسط در این مقیاس می‌گیرند ممکن است واقعاً دچار ناراحتی‌های جسمانی باشند."""
            )
        else:
            hs_nomre = "کم"
            hs_interpretation = (
                """نمره کم در این مقیاس بیانگر فقدان شکوه‌های بدنی است. حتی ممکن است نشانه‌ای از توجه ناکافی فرد به وضعیت جسمانی خود باشد، به طوری که حتی هنگامی که دچار ناراحتی جسمی است به پزشک مراجعه نمی‌کند. همچنین دلیل بر احساس مسئولیت و قدرت سازگاری آزمودنی با محیط است."""
            )
        interpretations['Hs'] = {'text': hs_text, 'interpretation': hs_interpretation, 't_score': hs_score, 'nomre': hs_nomre}


        hy_text = "این مقیاس دارای ۲۵ سؤال است."
        hy_interpretation = ""
        hy_nomre = ""

        if hy_score >= 70:
            hy_nomre = "وجود اختلال"
            hy_interpretation = (
                """افرادی که در مقیاس نمره بالا می‌آورند به خود توجه داشته و از دیگران توقع حمایت و محبت دارند و رفتارهای جنسی آن‌ها پرخاشگرانه بوده و فاقد شیوه‌های مورد قبول اجتماع است و نسبت به ناراحتی‌های خود بینش کافی ندارند و توقعات زیادی از روان‌درمانگر دارند."""
                """نمره بالا در این مقیاس احتمال روان‌پریشی را کم می‌کند."""
                """این افراد مقاومت زیادی از خود در روان‌درمانی نشان می‌دهند."""
            )
        elif 60 <= hy_score < 70:
            hy_nomre = "آمادگی یا گرایش ابتلا به اختلال"
            hy_interpretation = (
                """افرادی که در مقیاس نمره بالا می‌آورند به خود توجه داشته و از دیگران توقع حمایت و محبت دارند و رفتارهای جنسی آن‌ها پرخاشگرانه بوده و فاقد شیوه‌های مورد قبول اجتماع است و نسبت به ناراحتی‌های خود بینش کافی ندارند و توقعات زیادی از روان‌درمانگر دارند."""
                """نمره بالا در این مقیاس احتمال روان‌پریشی را کم می‌کند."""
                """این افراد مقاومت زیادی از خود در روان‌درمانی نشان می‌دهند."""
            )
        elif 40 <= hy_score < 60:
            hy_nomre = "به‌هنجار"
            hy_interpretation = (
                """نمره بین ۴۰ تا ۶۰ نشان‌دهنده سطح عادی از سازگاری اجتماعی و انعطاف‌پذیری است."""
                """افرادی که نمره متوسط در این مقیاس دریافت می‌کنند، به خصوص اگر تحصیلات عالی داشته و به گروه‌های بالاتر اجتماعی - اقتصادی تعلق داشته باشند، احتمالاً از سطح سازگاری خوبی برخوردارند."""
            )
        else:
            hy_nomre = "کم"
            hy_interpretation = (
                """افرادی که نمره پایین در این مقیاس می‌گیرند احتمالاً افرادی ساده‌اندیش، عیب‌جو، از نظر اجتماعی منزوی، تحت فشار و کنترل‌شده هستند و همچنین ممکن است به آسانی به دیگران اعتماد نکنند و شناختن آن‌ها نیز برای دیگران دشوار باشد."""
            )
        interpretations['Hy'] = {'text': hy_text, 'interpretation': hy_interpretation, 't_score': hy_score, 'nomre': hy_nomre}


        pd_text = """این مقیاس شباهت فرد را با گروهی می‌سنجد که اشکالات اصلی آن‌ها دشواری‌های شخصیتی است. این دشواری‌ها عبارتند از واکنش‌های عاطفی عمیق، ناتوانی در استفاده از تجارب و بی‌توجهی به قوانین و آداب اخلاقی و اجتماعی. به عبارت دیگر، محتوای این مقیاس ۱۹ سؤال و مربوط به ناسازگاری‌های اجتماعی، نداشتن تجربه‌های خوب در زندگی و شکایت و نارضایتی از وضع محیط و خانواده است."""
        pd_interpretation = ""
        pd_nomre = ""

        if pd_score >= 70:
            pd_nomre = "وجود اختلال"
            pd_interpretation = (
                """نمره زیاد در این مقیاس معمولاً خاص افرادی است که خود را قربانی خانواده خود می‌دانند، لذا علیه آن‌ها عصیان می‌کنند. این افراد از طرح نقشه برای آینده عاجزند و بدون تفکر و تعمق اینکه نتیجه رفتار خود را پیش‌بینی کنند دست به اقداماتی می‌زنند. در برخورد اول دیگران را تحت تأثیر قرار می‌دهند، اما به‌طور کلی روابط آن‌ها بسیار سطحی و ظاهری است و در دوستی‌ها و روابط خود به ندرت وفادار و صادق هستند. در نوجوانان بزهکار نمره Pd در پروفایل بالاست."""
                """افرادی که در این مقیاس نمره بالا می‌گیرند ممکن است از مشاغل و موقعیت‌های خوبی برخوردار باشند و تظاهرات بالینی در آن‌ها وجود داشته باشد."""
                """رفتار افرادی که نمره‌های بسیار بالایی دارند احتمالاً پرخاشگرانه و حتی تجاوزگرانه است و همچنین افرادی بی‌ثبات، غیرمسئول و خودمحور هستند و بسیاری از آنان به علت رفتارهای ضداجتماعی‌شان مشکلاتی با قانون پیدا می‌کنند."""
            )
        elif 60 <= pd_score < 70:
            pd_nomre = "آمادگی یا گرایش ابتلا به اختلال"
            pd_interpretation = (
                """نمره زیاد در این مقیاس معمولاً خاص افرادی است که خود را قربانی خانواده خود می‌دانند، لذا علیه آن‌ها عصیان می‌کنند. این افراد از طرح نقشه برای آینده عاجزند و بدون تفکر و تعمق اینکه نتیجه رفتار خود را پیش‌بینی کنند دست به اقداماتی می‌زنند. در برخورد اول دیگران را تحت تأثیر قرار می‌دهند، اما به‌طور کلی روابط آن‌ها بسیار سطحی و ظاهری است و در دوستی‌ها و روابط خود به ندرت وفادار و صادق هستند. در نوجوانان بزهکار نمره Pd در پروفایل بالاست."""
                """افرادی که در این مقیاس نمره بالا می‌گیرند ممکن است از مشاغل و موقعیت‌های خوبی برخوردار باشند و تظاهرات بالینی در آن‌ها وجود داشته باشد."""
            )
        elif 40 <= pd_score < 60:
            pd_nomre = "به‌هنجار"
            pd_interpretation = (
                """نمره بین ۴۰ تا ۶۰ نشان‌دهنده سطح عادی از سازگاری اجتماعی و اعتمادبه‌نفس است."""
                """نمره متوسط در این مقیاس نشانگر آن است که رفتارهای هنجارشکنی، اجتماع‌ستیزی و همچنین رفتارهای مخالف با موازین اخلاقی و اجتماعی در این فرد کمتر بوده و شخص احتمالاً توانسته است سازگاری نسبتاً خوبی را در خود پرورش دهد."""
                """افرادی که نمره متوسط می‌گیرند، افرادی ماجراجو، در جستجوی لذت، مردم‌آمیز، دارای اعتمادبه‌نفس، دارای جرأت ابراز وجود، غیر قابل اعتماد و تخیلی هستند."""
            )
        else:
            pd_nomre = "کم"
            pd_interpretation = (
                """نمره‌های کمتر از ۴۰ در این مقیاس معرف افرادی است بیش از حد کنترل‌شده، منتقد از خود، خشک، سنتی و کسانی که به گونه‌ای افراطی با معیارهای اجتماعی همانندسازی می‌کنند."""
            )
        interpretations['Pd'] = {'text': pd_text, 'interpretation': pd_interpretation, 't_score': pd_score, 'nomre': pd_nomre}


        pa_text = """این مقیاس دارای ۱۴ سؤال است که محتوای آن در خصوص حساسیت به موازین اخلاقی، بدبینی، شکایت از دیگران و تأکید بر کمبودهای گذشته شخص است. این مقیاس افکار و عقاید پارانوئید را بازشناسی می‌کند. پرسش‌هایی که در این مقیاس قرار داده شده است از سه نوع هستند: ۱- زودرنجی، ۲- سختگیری در اخلاق و منطق، ۳- افکار زیان و آسیب."""
        pa_interpretation = ""
        pa_nomre = ""

        if pa_score >= 70:
            pa_nomre = "وجود اختلال"
            pa_interpretation = (
                """نمره بالا در این مقیاس مخصوص افرادی است که گرایش‌های خودآزاری را بیرونی کرده و متوجه دیگران می‌کنند. سوءظن و بدبینی شدیدی نسبت به دیگران احساس کرده و معتقدند که مردم مستحق رنج‌ها، ناراحتی‌ها و مشکلاتی هستند که با آن مواجه‌اند. این افراد در روان‌درمانی بسیار خشک و غیر قابل انعطاف هستند."""
                """کلیه افرادی که نمره آن‌ها بالاتر از ۷۰ است به احتمال بسیار قوی از لحاظ روانی مشکوک هستند و اگر نمره فرد از ۸۰ بالاتر باشد، بیماری او قطعی است."""
            )
        elif 60 <= pa_score < 70:
            pa_nomre = "آمادگی یا گرایش ابتلا به اختلال"
            pa_interpretation = (
                """نمره بالا در این مقیاس مخصوص افرادی است که گرایش‌های خودآزاری را بیرونی کرده و متوجه دیگران می‌کنند. سوءظن و بدبینی شدیدی نسبت به دیگران احساس کرده و معتقدند که مردم مستحق رنج‌ها، ناراحتی‌ها و مشکلاتی هستند که با آن مواجه‌اند. این افراد در روان‌درمانی بسیار خشک و غیر قابل انعطاف هستند."""
            )
        elif 40 <= pa_score < 60:
            pa_nomre = "به‌هنجار"
            pa_interpretation = (
                """نمره بین ۴۰ تا ۶۰ نشان‌دهنده سطح عادی از اعتماد به دیگران و انعطاف‌پذیری است."""
            )
        else:
            pa_nomre = "کم"
            pa_interpretation = (
                """بیشتر افرادی که نمره پایین در این مقیاس می‌گیرند به عنوان افرادی کاملاً متعادل توصیف می‌شوند. این مطلب معمولاً در مورد افراد غیر بیمار صادق است و همین نمره در افراد بیمار به عنوان حساسیت افراطی، فقدان بینش، درون‌گرایی، غیر قابل اعتماد بودن، زودرنجی، خشونت، وجدان ضعیف و علایق محدود توصیف می‌شود. همچنین نمره کم در این مقیاس نشانه لجبازی است که پیشنهادات اصلاحی دیگران را قبول ندارند. افرادی که نمره بسیار کمی می‌گیرند احتمالاً پارانوئید هستند که فرایندهای فکری خود را پنهان می‌سازند. بنابراین ممکن است مشابه افرادی باشند که نمره بالایی می‌گیرند."""
            )
        interpretations['Pa'] = {'text': pa_text, 'interpretation': pa_interpretation, 't_score': pa_score, 'nomre': pa_nomre}


        pt_text = """این مقیاس تشابه فرد را با بیماران روانی که دچار ترس‌های مرضی یا وسواس هستند، بررسی می‌کند. ۱۶ سؤال این مقیاس علائم مرضی، اضطراب، تشویش، ترس، نشخوار فکری، خودتردیدی و دلهره‌های بی‌جا و بی‌ارزش فرد را تشکیل می‌دهند."""
        pt_interpretation = ""
        pt_nomre = ""

        if pt_score >= 70:
            pt_nomre = "وجود اختلال"
            pt_interpretation = (
                """نمره بالا در این مقیاس خاص افراد وسواسی بوده که از پدیده‌ها وحشت دارند، در تصمیم‌گیری ناتوانی از خود نشان می‌دهند، قادر نیستند فکر خود را بر روی موضوعی متمرکز کنند و افرادی کمال‌گرا و نگران‌اند."""
                """در این مقیاس مانند مقیاس Pa نمره بیشتر از ۸۰ نشانه حالت غیرطبیعی و مرضی است ولی اگر نتایج فرد بین ۷۰ تا ۸۰ باشد برای اینکه بتوان حکم به بیماری فرد نمود بهتر است که از نظر بالینی شواهدی در دست باشد."""
            )
        elif 60 <= pt_score < 70:
            pt_nomre = "آمادگی یا گرایش ابتلا به اختلال"
            pt_interpretation = (
                """نمره بالا در این مقیاس خاص افراد وسواسی بوده که از پدیده‌ها وحشت دارند، در تصمیم‌گیری ناتوانی از خود نشان می‌دهند، قادر نیستند فکر خود را بر روی موضوعی متمرکز کنند و افرادی کمال‌گرا و نگران‌اند."""
                """نمره بین ۶۰ و ۷۰ نشان‌دهنده گرایش خفیف به نگرانی و اضطراب است."""
            )
        elif 40 <= pt_score < 60:
            pt_nomre = "به‌هنجار"
            pt_interpretation = (
                """نمره بین ۴۰ تا ۶۰ نشان‌دهنده سطح عادی از آرامش و اعتمادبه‌نفس است."""
            )
        else:
            pt_nomre = "کم"
            pt_interpretation = (
                """افرادی که اعتمادبه‌نفس داشته و آرام، بانشاط، صمیمی، گرم و هوشیار هستند و احساس ایمنی دارند در این مقیاس نمره کم می‌آورند."""
            )
        interpretations['Pt'] = {'text': pt_text, 'interpretation': pt_interpretation, 't_score': pt_score, 'nomre': pt_nomre}


        sc_text = """به کمک این مقیاس می‌توان تقریباً به ۶۰ درصد از موارد اسکیزوفرنی پی برد. ۲۰ سؤال این مقیاس برای شناخت گوشه‌گیری، افکار عجیب و غریب و غیرعادی، شکایت از وضع خانوادگی و چگونگی برداشت از خود ساخته شده است."""
        sc_interpretation = ""
        sc_nomre = ""

        if sc_score >= 70:
            sc_nomre = "وجود اختلال"
            sc_interpretation = (
                """بالا بودن نمره در مقیاس Sc دلیل بر آن است که فرد خود را غریبه و تنها احساس می‌کند و می‌پندارد که دیگران او را درک نمی‌کنند و او عضو آن جامعه نیست. این افراد در مورد هویت و شخصیت خود تردید دارند و معتقدند که فردی بی‌ارزش هستند و احتمالاً در تمرکز حواس و دقت دچار مشکل هستند. این افراد به سادگی به دیگران اعتماد نمی‌کنند و نمی‌توانند با دیگران ارتباط برقرار کنند. ممکن است درمان آنان به‌خصوص در مراحل اولیه دشوار باشد. گاهی مواقع بعضی از افراد نوروتیک در این مقیاس نمره بالا می‌آورند. این مقیاس نه‌تنها در تشخیص سایکوز ارزش دارد بلکه ما را در شناخت شخصیت‌های آماده برای ابتلا به سایکوز نیز یاری می‌دهد."""
                """هر قدر نمره آزمودنی در این مقیاس بالا باشد پیش‌آگهی درمان بهتر خواهد بود."""
            )
        elif 60 <= sc_score < 70:
            sc_nomre = "آمادگی یا گرایش ابتلا به اختلال"
            sc_interpretation = (
                """بالا بودن نمره در مقیاس Sc دلیل بر آن است که فرد خود را غریبه و تنها احساس می‌کند و می‌پندارد که دیگران او را درک نمی‌کنند و او عضو آن جامعه نیست. این افراد در مورد هویت و شخصیت خود تردید دارند و معتقدند که فردی بی‌ارزش هستند و احتمالاً در تمرکز حواس و دقت دچار مشکل هستند. این افراد به سادگی به دیگران اعتماد نمی‌کنند و نمی‌توانند با دیگران ارتباط برقرار کنند. ممکن است درمان آنان به‌خصوص در مراحل اولیه دشوار باشد. گاهی مواقع بعضی از افراد نوروتیک در این مقیاس نمره بالا می‌آورند. این مقیاس نه‌تنها در تشخیص سایکوز ارزش دارد بلکه ما را در شناخت شخصیت‌های آماده برای ابتلا به سایکوز نیز یاری می‌دهد."""
                """هر قدر نمره آزمودنی در این مقیاس بالا باشد پیش‌آگهی درمان بهتر خواهد بود."""
            )
        elif 40 <= sc_score < 60:
            sc_nomre = "به‌هنجار"
            sc_interpretation = (
                """نمره بین ۴۰ تا ۶۰ نشان‌دهنده ثبات روانی و توانایی برقراری ارتباط با دیگران است."""
            )
        else:
            sc_nomre = "کم"
            sc_interpretation = (
                """نمره پایین در مقیاس Sc نشان‌دهنده ثبات روانی و احساس تعلق به جامعه است."""
            )
        interpretations['Sc'] = {'text': sc_text, 'interpretation': sc_interpretation, 't_score': sc_score, 'nomre': sc_nomre}


        ma_text = """این مقیاس غالباً در افرادی که مبتلا به فعالیت شدید فکری و حرکتی هستند دیده می‌شود. سؤال‌هایی که در این مقیاس وجود دارند از دو نوع هستند: دسته‌ای که به تظاهرات و برون‌گرایی مربوط می‌شود و دسته دیگر به تحریک‌پذیری ارتباط دارد."""
        ma_interpretation = ""
        ma_nomre = ""

        if ma_score >= 70:
            ma_nomre = "وجود اختلال"
            ma_interpretation = (
                """نمره بالا در این مقیاس دامنه وسیعی از فعالیت‌هایی که متوجه احساس و رفتارهای بیهوده و برخلاف سنن اجتماعی است را نشان می‌دهد. نمره بالا را در این مقیاس کسانی دارند که بر روی رفتارهای خود کنترل ندارند و در برابر تحریک‌ها واکنش فوری از خود نشان می‌دهند که گاهی توهین‌آمیز و خستگی‌ناپذیر جلوه می‌کنند. حساسیت، زودرنجی، خصومت نسبت به دیگران و عدم اعتمادبه‌نفس و در عین حال خوش‌بینی غیرعادی نسبت به آینده را در این افراد می‌توان مشاهده کرد."""
            )
        elif 60 <= ma_score < 70:
            ma_nomre = "آمادگی یا گرایش ابتلا به اختلال"
            ma_interpretation = (
                """نمره بالا در این مقیاس دامنه وسیعی از فعالیت‌هایی که متوجه احساس و رفتارهای بیهوده و برخلاف سنن اجتماعی است را نشان می‌دهد. نمره بالا را در این مقیاس کسانی دارند که بر روی رفتارهای خود کنترل ندارند و در برابر تحریک‌ها واکنش فوری از خود نشان می‌دهند که گاهی توهین‌آمیز و خستگی‌ناپذیر جلوه می‌کنند. حساسیت، زودرنجی، خصومت نسبت به دیگران و عدم اعتمادبه‌نفس و در عین حال خوش‌بینی غیرعادی نسبت به آینده را در این افراد می‌توان مشاهده کرد."""
            )
        elif 40 <= ma_score < 60:
            ma_nomre = "به‌هنجار"
            ma_interpretation = (
                """نمره بین ۴۰ تا ۶۰ نشان‌دهنده سطح عادی از انرژی و تعامل اجتماعی است."""
            )
        else:
            ma_nomre = "کم"
            ma_interpretation = (
                """نمره کم در این مقیاس نشان‌دهنده بی‌اعتمادی به خود است. نمره خیلی پایین در این مقیاس و نمره بالا در مقیاس D افسردگی را مسجل می‌کند."""
                """نمره پایین در این مقیاس بازنگر این مطلب است که فرد از سطح انرژی و فعالیت کمی برخوردار است و اغلب قابل اتکا، منطقی و قابل اعتماد توصیف می‌شود. در عین حال ممکن است کسانی که نمره پایین می‌آورند فاقد اعتمادبه‌نفس، منزوی، کم‌حرف، آرام، کمرو و بیش از اندازه کنترل‌شده باشند. نمره‌های بسیار پایین نشان‌دهنده افسردگی جدی است حتی اگر نمره مقیاس D در حد به‌هنجار باشد."""
            )
        interpretations['Ma'] = {'text': ma_text, 'interpretation': ma_interpretation, 't_score': ma_score, 'nomre': ma_nomre}


        l_text = """پنج سؤال این مقیاس برای تشخیص سادگی، خشکی و تحجر فکری یا دروغ‌گویی و در عین حال کمال‌گرایی افراطی آزمودنی است. بر اساس نمرات این مقیاس می‌توان پی برد که تا چه اندازه آزمودنی کوشیده است خود را بهتر از آنچه هست جلوه دهد."""
        l_interpretation = ""
        l_nomre = "محاسبه شده"

        if l_score > 60:
            l_interpretation = (
                """نمرات بالا در مقیاس L نشان‌دهنده تلاش برای ارائه تصویر بسیار مثبت و حتی غیرواقعی است که ممکن است از تمایل فرد به سرپوش گذاشتن بر نقاط ضعف نشأت بگیرد. نمرات خام بالای ۴ و ۵ ممکن است به معنای عدم صداقت قابل توجه و نیاز به احتیاط در تفسیر نتایج باشد."""
                """اگر نمره آزمودنی در این مقیاس بالا باشد، نشانه این است که نمرات و نتایج آزمودنی احتمالاً بالاتر از آن نمره‌ای است که به دست آورده است. در بعضی موارد نتیجه L نشان‌دهنده خصوصیاتی از شخصیت آزمودنی است. نمره زیاد در طبقات پایین اجتماع در این مقیاس عادی است ولی در افرادی که دارای تحصیلات هستند معرف نقص یا اشکال در قوه قضاوت آن‌هاست. به‌طور کلی نمره در این مقیاس بر تعدادی از ماده‌ها که تصویر خوشایندی از آزمودنی می‌دهند، استوار است ولی پاسخ به آن‌ها در جهت مقبول به ندرت گویای حقیقت است."""
            )
        elif 40 <= l_score <= 60:
            l_interpretation = (
                """فرد ممکن است کمی از نقاط ضعف خود دوری کند، اما همچنان تمایل به صداقت نسبی در پاسخ‌ها دارد."""
            )
        else:
            l_interpretation = (
                """نشان‌دهنده تمایل به پذیرش ضعف‌ها و ارائه تصویری واقع‌بینانه از خود است. این افراد معمولاً به خودآگاهی بیشتری دست یافته و نقاط ضعف و مشکلات خود را انکار نمی‌کنند."""
            )
        interpretations['L'] = {'text': l_text, 'interpretation': l_interpretation, 't_score': l_score, 'nomre': l_nomre}


        f_text = """این مقیاس نشان می‌دهد که فرد ممکن است به سؤالات به صورت غیرمعمول یا نامتعارف پاسخ داده باشد."""
        f_interpretation = ""
        f_nomre = "محاسبه شده"

        if f_score > 60:
            f_interpretation = (
                """این نمرات ممکن است نشان‌دهنده پاسخ‌های غیرمعمول یا بزرگنمایی مشکلات باشند. نمرات بالای ۷۰ ممکن است به معنای عدم اعتبار نتایج و پاسخ‌های غیرعادی یا نمایشی باشد."""
                """نمره زیاد در این مقیاس احتمالاً سایر نمرات مقیاس‌های دیگر را بی‌اعتبار می‌کند. نمره زیاد در این مقیاس بیشتر معلول اشتباه آزمودنی نسبت به درک ۱۵ سؤال این مقیاس است و نشان می‌دهد که بی‌دقتی کرده یا عدم همکاری از خود نشان داده و حتی نتوانسته است آن‌ها را بفهمد یا اینکه اشتباهات مهمی در نمره دادن و استخراج رخ داده است."""
                """افرادی که دارای افکار غیرعادی هستند با آن‌هایی که گوشه‌گیر و از مردم گریزان‌اند و در فعالیت‌ها شرکت نمی‌کنند و دارای حساسیت‌هایی هستند در این مقیاس نمره زیاد دریافت می‌کنند. در این گروه از افراد اضطراب فوق‌العاده، اجتماع‌ستیزی، بی‌قراری، افکار و عقاید خاص، تحجر و تغییرات پی‌درپی را می‌توان استنباط نمود."""
            )
        elif 40 <= f_score <= 60:
            f_interpretation = (
                """نشان‌دهنده تمایل نسبی به سازگاری است اما ممکن است در برخی موارد فرد کمی تمایل به بزرگنمایی داشته باشد."""
            )
        else:
            f_interpretation = (
                """نمرات پایین نشان‌دهنده سازگاری و پاسخ‌های قابل پیش‌بینی است که به احتمال زیاد منعکس‌کننده تجربه‌های واقعی فرد است."""
                """اگر نمره این مقیاس پایین باشد، نشانه این است که آزمودنی فردی است منطقی و جواب‌های نسبتاً درستی داده است."""
                """نمره کم در این مقیاس صمیمیت، آرامش، سادگی و قابل اعتماد بودن آزمودنی را نشان می‌دهد."""
            )
        interpretations['F'] = {'text': f_text, 'interpretation': f_interpretation, 't_score': f_score, 'nomre': f_nomre}


        k_text = """تعداد سؤال‌های این مقیاس ۱۶ است. نمره این مقیاس که بر ترکیب خاصی از ماده‌ها استوار است، شاخص نگرش فرد نسبت به آزمون است. نتیجه و نمره این مقیاس اصولاً به عنوان وسیله‌ای برای تصحیح در جهت افزایش قدرت تشخیص مقیاس‌های بالینی این پرسشنامه به کار می‌رود. در صورتی که لازم باشد تعریف غیرآماری از این مقیاس ارائه دهیم باید بگوییم که مقیاس K چگونگی رفتار فرد را نسبت به آزمون ارزیابی می‌کند."""
        k_interpretation = ""
        k_nomre = "محاسبه شده"

        if k_score > 60:
            k_interpretation = (
                """نمره بالا در این مقیاس ممکن است حاکی از حالت دفاعی یا کوشش برای ارائه تصویر مطلوبی از خود باشد و معرف این است که آنان افرادی ناایمن بوده و در روابط اجتماعی و کنش‌های متقابل خود با دیگران دارای مشکلات فراوانی هستند؛ زندگیشان فاقد نظم و ترتیب و روال مشخص است و در عین حال قادر به تحمل نامرتبی و بی‌نظمی دیگران نیستند؛ پیشنهادات اصلاحی دیگران را نمی‌توانند بپذیرند و قادر نیستند که نظر دیگران را نسبت به رفتار خود پیش‌بینی کنند و در این مورد بینشی ندارند."""
            )
        elif 40 <= k_score <= 60:
            k_interpretation = (
                """نمرات متوسط نشان‌دهنده تمایل به تعادل در ارائه خود، بدون تلاش بیش از حد برای دفاع از خود یا ارائه تصویری کاملاً منفی."""
                """افرادی که در این مقیاس حدوداً نمره‌ای متوسط می‌گیرند افرادی منطقی، متکبر و دارای رفتارهای اجتماعی مورد قبول هستند."""
            )
        else:
            k_interpretation = (
                """نمره کم افراد احتمالاً نشان‌دهنده رک‌گویی، انتقاد از خود، بدبینی نسبت به دیگران یا کوشش برای ارائه تصویر نامطلوبی از خودشان است. این افراد در اظهار ناراحتی خود اغراق می‌کنند و در عین حال افرادی محتاط و صلح‌جو هستند."""
            )
        interpretations['K'] = {'text': k_text, 'interpretation': k_interpretation, 't_score': k_score, 'nomre': k_nomre}


        combinations = []
        added_combinations = set()

        if hs_score > d_score and hy_score > d_score:
            combination_name = 'ترکیب HS و H بیشتر از D'
            if combination_name not in added_combinations:
                combinations.append({
                    'name': combination_name,
                    'interpretation': "هرگاه نمره فرد در این مقیاس بالاتر از مقیاس D و نمره فرد در Hy بالاتر از D باشد. منحنی به دست‌‌ آمده را V تبدیلی می‌نامند . این نوع ترکیب نمرات را در افرادی میبینیم که ناراحتی‌های عاطفی درگیری‌ها و کشمکش‌های درونی خود را به صورت درد‌های بدنی و جسمانی ارائه می‌دهند و گرایش‌های هیستریک به معنای کلاسیک واقعی کلمه را از خود نشان می‌دهند. V تبدیلی",
                    'scales': ['Hs','D','Hy']
                })
                added_combinations.add(combination_name)

        if hs_score > 70 and sc_score > 70:
            combination_name = 'ترکیب HS بیشتر از SC'
            if combination_name not in added_combinations:
                combinations.append({
                    'name': combination_name,
                    'interpretation': "باید توهمات بدنی را از آزمودنی انتظار داشت",
                    'scales': ['Hs','Sc']
                })
                added_combinations.add(combination_name)

        if hs_score > 70 and hy_score > 70:
            if pt_score < 35 and d_score < 35 and sc_score < 35:
                combination_name = 'HS و HY بیشتر از 70'
                if combination_name not in added_combinations:
                    combinations.append({
                        'name': combination_name,
                        'interpretation': "باید عنوان کرد که آزمودنی سعی داشته است خود را کاملاً عادی نشان دهد. گاه با روان‌درمانی می‌توان وضع این افراد را بهبود بخشید، ولی ایجاد تغییر در زمینه‌های شخصیتی آنان مشکل است. ",
                        'scales': ['Hs','Hy','Pt','D','Sc']
                    })
                    added_combinations.add(combination_name)

        if hs_score > 70:
            if pt_score > 70 and d_score > 70 and sc_score > 70:
                combination_name = 'PT و D و SC بیشتر از 70'
                if combination_name not in added_combinations:
                    combinations.append({
                        'name': combination_name,
                        'interpretation': "این حالت بیانگر سطوح متناظر افسردگی، انکار، روان رنجوری‌های تبدیلی با حالت‌های اضطرابی است. در هر حال، افرادی که نمره‌‌های بالایی در این مقیاس دریافت می‌کنند نوعاً اضطراب کمی ‌را تجربه می‌کنند. ",
                        'scales': ['Pt','D','Hs','Sc']
                    })
                    added_combinations.add(combination_name)

        if d_score > 70 and pt_score > 70:
            combination_name = 'D و PT بیشتر از 70'
            if combination_name not in added_combinations:
                combinations.append({
                    'name': combination_name,
                    'interpretation': "تابلوی بالینی فردی را که از خود تنفر دارد، خود را بی‌ارزش می‌داند، دارای تنش و بی‌قراری است و گرایش به خودآزاری دارد را نشان می‌دهد این دو مقیاس و اغلب مقیاس‌های درماندگی می‌نامند.",
                    'scales': ['D','Pt']
                })
                added_combinations.add(combination_name)

        if d_score > 70 and sc_score > 70:
            combination_name = 'D و SC بیشتر از 70'
            if combination_name not in added_combinations:
                combinations.append({
                    'name': combination_name,
                    'interpretation': "می‌تواند نشانگر افسردگی با ویژگی‌هایی مانند افکار غیر معمول، فقدان پیوند جویی، انزوا و احساس بیگانگی باشد.",
                    'scales': ['D','Sc']
                })
                added_combinations.add(combination_name)

        if d_score > 70 and hy_score > 70 and pt_score > 70:
            combination_name = 'd'
            if combination_name not in added_combinations:
                combinations.append({
                    'name': combination_name,
                    'interpretation': "معرف وابستگی آزمودنی به دیگران است ",
                    'scales': ['D','Hy','Pt']
                })
                added_combinations.add(combination_name)

        if d_score > 70 and pd_score > 70 and pt_score > 70 and sc_score > 70:
            combination_name = 'D و PD و PT و SC بیشتر از 70'
            if combination_name not in added_combinations:
                combinations.append({
                    'name': combination_name,
                    'interpretation': "کسانی هستند که ممکن است گرایش به خودکشی داشته باشند. این افراد از نظر درمان همکاری و پیشرفت‌های لازم را از خود نشان می‌دهند. و بر خلاف مقیاس هیپوکندری این مقیاس نسبت به درمان بسیار حساس است و به مجرد این که در علائم بالینی بهبودی حاصل شود نتایج این مقیاس نیز پایین می‌آید. ",
                    'scales': ['D','Pd','Pt','Sc']
                })
                added_combinations.add(combination_name)

        if hy_score > 70 and k_score > 70:
            if sc_score < 40 and f_score < 40:
                combination_name = 'HY و K بیشتر از 70 با SC و F پایین'
                if combination_name not in added_combinations:
                    combinations.append({
                        'name': combination_name,
                        'interpretation': "نیمرخ روانی فردی را داریم که احتمالاً بازداری شده پیوند جو است و نیاز شدیدی به دوست داشته شدن و تأیید دیگران دارد.",
                        'scales': ['Hy','K','Sc','F']
                    })
                    added_combinations.add(combination_name)

        if hy_score > 70:
            if pt_score > 70 and sc_score > 70:
                combination_name = 'HY بیشتر از 70 با PT و SC بالا'
                if combination_name not in added_combinations:
                    combinations.append({
                        'name': combination_name,
                        'interpretation': "نمره بالا در این مقیاس احتمال روان‌پریشی را کم می‌کند، حتی اگر مقیاس‌‌های Pt و Sc هم نسبتاً بالا باشند.",
                        'scales': ['Hy','Pt','Sc']
                    })
                    added_combinations.add(combination_name)

        if pd_score > 70 and ma_score > 70:
            combination_name = 'PD و MA بالا'
            if combination_name not in added_combinations:
                combinations.append({
                    'name': combination_name,
                    'interpretation': "وجود اختلال‌های رفتاری را نشان می‌دهد. این افراد همیشه هنجار شکن بوده، اجتماع ستیز و مخالف با موازین اخلاقی و اجتماعی هستند.",
                    'scales': ['Pd','Ma']
                })
                added_combinations.add(combination_name)

        if pd_score > 70 and hy_score > 70:
            combination_name = 'PD و HY بالا'
            if combination_name not in added_combinations:
                combinations.append({
                    'name': combination_name,
                    'interpretation': "خاص افرادی است که افکار و عواطف کودکانه دارند و رشد اجتماعی و عاطفی کافی را از خود نشان نمی‌دهند.",
                    'scales': ['Pd','Hy']
                })
                added_combinations.add(combination_name)

        if pd_score > 70 and f_score > 70 and sc_score > 70:
            if d_score < 40:
                combination_name = 'PD، F و SC بالا با D پایین'
                if combination_name not in added_combinations:
                    combinations.append({
                        'name': combination_name,
                        'interpretation': "معرف افرادی است که خود آزارند و از ایجاد اضطراب و ایجاد گناه در خود لذت می‌برند. این افراد به روان‌درمانی به دشواری پاسخ می‌دهند.",
                        'scales': ['Pd','F','Sc','D']
                    })
                    added_combinations.add(combination_name)

        if pa_score > 70 and sc_score > 70:
            combination_name = 'PA و SC بالا'
            if combination_name not in added_combinations:
                combinations.append({
                    'name': combination_name,
                    'interpretation': "ممکن است نشانه‌ی اسکزوفرنیا از نوع پارانوئید باشد.",
                    'scales': ['Pa', 'Sc']
                })
                added_combinations.add(combination_name)

        if hy_score > 70 and pa_score > 70:
            combination_name = 'HY و PA بالا'
            if combination_name not in added_combinations:
                combinations.append({
                    'name': combination_name,
                    'interpretation': "تصویر بالینی شخصیت پارانوئیدی را نشان می‌دهد که گرایش‌های نابهنجار خویش و به خصوص برداشت غیر عادی خود از دیگران را انکار می‌کند و ظاهراً ساده مثبت جلوه می‌کند.",
                    'scales': ['Hy','Pa']
                })
                added_combinations.add(combination_name)

        if pt_score > 70 and sc_score > 70:
            combination_name = 'PT و SC بالا'
            if combination_name not in added_combinations:
                combinations.append({
                    'name': combination_name,
                    'interpretation': "احتمال اسکیزوفرنی از نوع پیشرفته آن ممکن است.",
                    'scales': ['Pt','Sc']
                })
                added_combinations.add(combination_name)

        if 60 <= pt_score <= 70 and 60 <= d_score <= 70:
            combination_name = 'متوسط pt  d'
            if combination_name not in added_combinations:
                combinations.append({
                    'name': combination_name,
                    'interpretation': "بیانگر یک پیش آگهی خوب برای درمان است.",
                    'scales': ['Pt','D']
                })
                added_combinations.add(combination_name)

        if sc_score > 70 and pt_score > 70:
            if pt_score > sc_score:
                combination_name = 'pt sc ترکیب '
                if combination_name not in added_combinations:
                    combinations.append({
                        'name': combination_name,
                        'interpretation': "تشخیص احتمالا نوروز است.",
                        'scales': ['Sc','Pt']
                    })
                    added_combinations.add(combination_name)

        if sc_score > 70 and pd_score > 70:
            combination_name = 'بالا sc و pd'
            if combination_name not in added_combinations:
                combinations.append({
                    'name': combination_name,
                    'interpretation': "نشان دهنده فردی است که نسبت به دنیای خود به شدت احساس بیگانگی و بی‌اعتمادی می‌کند.",
                    'scales': ['Sc','Pd']
                })
                added_combinations.add(combination_name)

        if sc_score > 70 and ma_score > 70:
            combination_name = 'بالا sc و ma'
            if combination_name not in added_combinations:
                combinations.append({
                    'name': combination_name,
                    'interpretation': "در این حالت فرد به طور مرتب مسیر گفتگو را تغییر داده و اغلب آن را به مسائل غیر عادی می‌کشاند.",
                    'scales': ['Sc','Ma']
                })
                added_combinations.add(combination_name)

        if sc_score > 70 and pd_score > 70 and d_score > 70 and f_score > 70:
            combination_name = 'SC، PD، D و F بالا'
            if combination_name not in added_combinations:
                combinations.append({
                    'name': combination_name,
                    'interpretation': "بالا بودن مقیاس‌های F، D، Pd و SC نیمرخ اسکیزوئید را نشان می‌دهد.",
                    'scales': ['Sc','Pd','D','F',]
                })
                added_combinations.add(combination_name)

        if ma_score < 40 and d_score > 70:
            combination_name = 'MA پایین و D بالا'
            if combination_name not in added_combinations:
                combinations.append({
                    'name': combination_name,
                    'interpretation': "نمره خیلی پایین در مقیاس هیپومانی و نمره بالا در مقیاس D افسردگی را مسجل می‌کند.",
                    'scales': ['Ma','D']
                })
                added_combinations.add(combination_name)

        if d_score < 40 and pt_score < 40:
            if ma_score > 70 and k_score < 60:
                combination_name = 'D و PT پایین با MA بالا و K پایین'
                if combination_name not in added_combinations:
                    combinations.append({
                        'name': combination_name,
                        'interpretation': "وقتی نمره D و Pt پایین و مقیاس Ma بالا باشد، معرف رقابت خصمانه و پرخاشگری در آزمودنی است.",
                        'scales': ['D','Pt','Ma','K']
                    })
                    added_combinations.add(combination_name)

        if d_score > 70 and ma_score > 70:
            combination_name = 'D و MA بالا'
            if combination_name not in added_combinations:
                combinations.append({
                    'name': combination_name,
                    'interpretation': "معرف برانگیخته بودن بیمار است و حالت‌هایی از خودشیفتگی، اختلال در همانند‌سازی، درون گرایی و اندیشناکی در دوران نوجوانی در افراد دیده می‌شود.",
                    'scales': ['D','Ma']
                })
                added_combinations.add(combination_name)

        if ma_score < 40:
            combination_name = 'پایین ma'
            if combination_name not in added_combinations:
                combinations.append({
                    'name': combination_name,
                    'interpretation': "نمره‌‌های بسیار پایین نشان دهنده افسردگی جدی است حتی اگر نمره مقیاس D در حد بهنجار باشد.",
                    'scales': ['Ma']
                })
                added_combinations.add(combination_name)

        combined_scores = {
            "validity_scores": [],
            "clinical_scores": [],
        }

        for scale, raw_score in validity_scores.items():
            t_score = t_scores.get(scale, "-")
            if t_score == "-":
                t_score_range = "-"
            elif t_score <= 40:
                t_score_range = "پایین"
            elif t_score <= 60:
                t_score_range = "متوسط"
            else:
                t_score_range = "بالا"
            
            combined_scores["validity_scores"].append({
                "scale": scale,
                "raw_score": raw_score,
                "t_score": t_score,
                "range": t_score_range
            })
        
        for scale, raw_score in clinical_scores.items():
            t_score = t_scores.get(scale, "-")
            if t_score == "-":
                t_score_range = "-"
            elif t_score <= 40:
                t_score_range = "پایین"
            elif 40 <= t_score < 60:
                t_score_range= "به‌هنجار"
            elif 60 <= t_score < 70:
                t_score_range = "آمادگی یا گرایش ابتلا به اختلال"
            elif t_score >= 70:
                t_score_range = "وجود اختلال"
          
            combined_scores["clinical_scores"].append({
                "scale": scale,
                "raw_score": raw_score,
                "t_score": t_score,
                "range": t_score_range
            })

        L_raw_threshold = 4
        invalid_message = ""
        is_valid = True

        if validity_scores.get("L", 0) > L_raw_threshold:
            is_valid = False
            invalid_message = "نمره L (دروغ‌سنج) شما بزرگتر از ۴ است و نتایج تست معتبر نمی‌باشد."

        clinical_t_scores = {scale: t_score for scale, t_score in t_scores.items() if scale in clinical_scores}
        validity_t_scores = {scale: t_score for scale, t_score in t_scores.items() if scale in validity_scores}

        for combination in combinations:
            related_scales = combination.get('scales', [])
            for scale in related_scales:
                if scale in interpretations:
                    if "related_combinations" not in interpretations[scale]:
                        interpretations[scale]["related_combinations"] = []
                    interpretations[scale]["related_combinations"].append({
                        "name": combination["name"],
                        "interpretation": combination["interpretation"]
                    })

        return {
            "validity_scores": validity_scores,
            "clinical_scores": clinical_scores,
            "interpretations": interpretations,
            "t_scores": t_scores,
            "combined_scores": combined_scores,
            "db_data": 2, 
            "is_valid": is_valid,
            "combinations": combinations,
            "clinical_t_scores": clinical_t_scores,
            "validity_t_scores": validity_t_scores,
            "invalid_message": invalid_message if not is_valid else ""  
        }
